---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpatialElementDomainData
source: html/5be47195-fb78-5dd2-e976-f3764a1aafa2.htm
---
# SpatialElementDomainData Properties

Specifies whether the .NET object represents a valid Revit entity.